{"posts":[{"title":"About","text":"Welcom to my website!I am an associate researcher at the Research Center for Intelligent Computing Systems, Institute of Computing Technology, Chinese Academy of Sciences. I received my bachelor’s degree and PH.D. from Tsinghua University in 2014 and 2019 (advised by Professor Xiaowei Cui). Areas of research interests/research projects Integrated Navigation System for Autonomous Robots. Multi-sensor Fusion, including camera, LiDAR, Global Navigation Satellite System (GNSS), Inertial Measurement Unit (IMU), etc. Positioning, Decision-making, and Path Planning for Autonomous Driving. Simultaneous Localization and Mapping (SLAM) based on cameras and LiDARs. Planning and Control of Field Robots. Key Technologies of Autonomous Navigation for Deep-Space Exploration rover. GNSS RTK technology in urban environments.","link":"/2024/03/21/About/"}],"tags":[],"categories":[],"pages":[{"title":"Platforms","text":"Platforms will be Update soon!","link":"/platforms/index.html"},{"title":"Dataset","text":"Dataset will be Update soon!","link":"/dataset/index.html"},{"title":"Publications","text":"2024 Yifan gao, Wei Li*, Yu Hu*, Trajectory Planning for Autonomous Driving Featuring Time-Varying Road Curvature and Adhesion Constraints, IEEE Transactions on Intelligent Transportation Systems, 2024 (Early access). Andong Yang, Wei Li*, Yu Hu*, F3DMP: Foresighted 3D Motion Planning of Mobile Robots in Wild Environments, 2024 IEEE International Conference on Robotics and Automation (ICRA), Yokohama, Japan, May 13 - May 17, 2024, pp. 12643-12649. Andong Yang, Wei Li*, Yu Hu*, Speed Planning Based on Terrain-Aware Constraint Reinforcement Learning in Rugged Environments, IEEE Robotics and Automation Letters, 2024, 9(3): 2096-2103, doi: 10.1109/LRA.2024.3354629. 2023 Wensong Chen, Wei Li*, Andong Yang, Yu Hu*, Active Visual SLAM Based on Hierarchical Reinforcement Learning, 2023 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), Detroit, Michigan, USA, October 1- October 5, 2023, pp. 7155-7162, doi: 10.1109/IROS55552.2023.10341780. Cheng Ye, Wei Li*, Yu Hu*, A Tightly-Coupled GNSS RTK/INS Positioning Algorithm Based on Adaptive Lag Smoother, in IEEE Intelligent Vehicles Symposium (IV), Anchorage, Alaska, USA, June 4 - June 7, 2023, pp. 1-8, doi: 10.1109/IV55152.2023.10186552. 2022 Andong Yang, Wei Li*, Yu Hu*, SMS-MPC: Adversarial Learning-based Simultaneous Prediction Control with Single Model for Mobile Robots, 2022 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), Kyoto, Japan, October 23–27, 2022, pp. 10905-10912, doi: 10.1109/IROS47612.2022.9981289. Jingyu Niu, Yu Hu*, Wei Li, Guangyan Huang, Yinhe Han, Xiaowei Li, Closing the Dynamics Gap via Adversarial and Reinforcement Learning for High-Speed Racing, 2022 International Joint Conference on Neural Networks (IJCNN), oral (Candidate of Best Paper Award), Padua, Italy, July 18-23, 2022, pp. 01-10, doi: 10.1109/IJCNN55064.2022.9892424. 2021 Wei Li*, Yu Hu, Yinhe Han, Xiaowei Li, KFS-LIO: Key-Feature Selection for Lightweight Lidar Inertial Odometry, 2021 IEEE International Conference on Robotics and Automation (ICRA), Xi’an, China, May 30 - June 4, 2021, pp. 5042-5048, doi: 10.1109/ICRA48506.2021.9561324. During my doctoral studies Wei Li, Xiaowei Cui*, Yimin Wei, Mingquan Lu, An Ambiguity-free Smoothing Algorithm for Multipath Mitigation in INS/RTK Tightly-Coupled Integration, Proceedings of the 32nd International Technical Meeting of the Satellite Division of The Institute of Navigation (ION GNSS+ 2019), Miami, Florida, USA, September 16 - 20, 2019, pp. 2980-2990, doi:10.33012/2019.16964. Wei Li, Xiaowei Cui*, Mingquan Lu, A robust graph optimization realization of tightly coupled GNSS/INS integrated navigation system for urban vehicles, Tsinghua Science and Technology, 2018, 23(6): 724-732. Wei Li, Wenyi Li, Xiaowei Cui*, Sihao Zhao, Mingquan Lu, A Tightly Coupled RTK/INS Algorithm with Ambiguity Resolution in the Position Domain for Ground Vehicles in Harsh Urban Environments, Sensors, 2018, 18(7): 2160. Wei Li, Xiaowei Cui*, Xueyong Xu, Mingquan Lu, An Improved Ambiguity Resolution Algorithm Based on Particle Filter for INS/RTK Integration in Urban Environments, Proceedings of the 31st International Technical Meeting of the Satellite Division of The Institute of Navigation (ION GNSS+ 2018), Miami, Florida, USA, September 24 - 28, 2018, pp.3122-3135, doi: 10.33012/2018.15981. Qin Shi, Xiaowei Cui*, Wei Li, Yu Xia, Mingquan Lu, Visual-UWB Navigation System for Unknown Environments, Proceedings of the 31st International Technical Meeting of the Satellite Division of The Institute of Navigation (ION GNSS+ 2018), Miami, Florida, USA, September 24 - 28, 2018, pp.3111-3121, doi: 10.33012/2018.15962. Zheng Cao, Sihao Zhao, Xiaowei Cui*, Wei Li, Mingquan Lu, Indoor Autonomous Vehicle Navigation Based on a Wireless Position and Orientation Determination System, Proceedings of the 31st International Technical Meeting of the Satellite Division of The Institute of Navigation (ION GNSS+ 2018), Miami, Florida, USA, September 24 - 28, 2018, pp.703-716, doi: 10.33012/2018.16048","link":"/publications/index.html"},{"title":"Projects","text":"Projects will be Update soon!","link":"/projects/index.html"},{"title":"Group","text":"Group will be Update soon!","link":"/group/index.html"}]}